
<!DOCTYPE html>
<head></head>
<body  bgcolor=lightblue>
   <style>
      p {
         text-align: justify;
         max-width: 75%;
         font-family: Verdana, Geneva, Tahoma, sans-serif;
      }
      h1{
         text-decoration: underline;
         font-family: Verdana, Geneva, Tahoma, sans-serif;
         color: #000080;
      }
   </style>
       
   <br>
   
   <center> <h1> ARDUINO UNO </h1>
   
      <br>

      <img src="https://upload.wikimedia.org/wikipedia/commons/3/38/Arduino_Uno_-_R3.jpg" width="25%">
      
      <img src="Arduino_Uno_-_R3.png" width="25%">
      <br>
      

   <p>De forma estricta, el proyecto Arduino se inici&oacute; en el a&ntilde;o 2005 como un proyecto enfocado 
      a estudiantes en el Interaction Design Institute Ivrea (IDII), de Ivrea (Italia). En aquellos a&ntilde;os, 
      los estudiantes usaban el microcontrolador BASIC Stamp, cuyo costo era de $100 USD, un costo considerablemente 
      alto para un estudiante promedio. 
   </p>
   <p>Antes del a&ntilde;o 2005, espec&iacute;acute;ficamente durante el a&ntilde;o 
      2003, Hernando Barrag&aacute;n hab&iacute;a creado la plataforma de desarrollo Wiring como resultado de su 
      proyecto de tesis en la maestr&iacute;a en el IDII, bajo la supervisi&oacute;n de Massimo Banzi y Casey Reas, 
      quienes eran conocidos por haber trabajado en el lenguaje Processing y daban clases en el IDII. 
   </p>

    <p>  El objetivo del proyecto era crear herramientas simples y de bajo costo para la creaci&oacute;n de proyectos
       digitales por parte de personas sin altos conocimientos t&eacute;cnicos o sin un perfil de ingenier&iacute;a. 
      </p>    
   <p>   El proyecto Wiring era una placa de desarrollo de hardware que constaba de una placa de circuito impreso (PCB) 
      con un microcontrolador ATmega168, un Ambiente de Desarrollo Integrado (IDE) basado en funciones de 
      procesamiento y una biblioteca de funciones para programar f&aacute;cilmente el microcontrolador.
   </p>    
    <p>  Regresando al a&ntilde;o 2005, Massimo Banzi junto con David Mellis (otro estudiante del IDII) y David Cuartielles, 
      agregaron soporte a Wiring para el microcontrolador ATmega8, m&aacute;s econ&oacute;mico que el inicial (Atmega168). 
   </p>
   <br>

   <img src="https://arduino.cl/wp-content/uploads/2019/01/Arduino-Team.jpeg"><div align="center">

   <br>

   <p>  
      Pero en lugar de continuar el desarrollo en Wiring, se separaron del proyecto y lo renombraron Arduino. 
      El nombre Arduino viene de un bar en Ivrea, Italia, en donde algunos de los fundadores del proyecto 
      Arduino sol&iacute;an reunirse. 
   </p>
   <p>   
      El bar tiene el nombre de Bar di Re Arduino, y fue nombrado en honor a Arduino de Ivrea, quien fue el margrave 
      de la Marca de Ivrea y Rey de Italia desde el a&ntilde;o 1002 hasta el a&ntilde;o 1014. 
      El equipo inicial de Arduino estaba conformado por Massimo Banzi, David Cuartielles, Tom Igoe, Gianluca Martino y 
      David Mellis. Hernando Barrag&aacute;n no fue invitado a participar. 
   </p>
   <p>   
    Posteriormente el proyecto Wiring sigui&oacute; adelante con placas menos densas y costosas que se distribuyeron a 
    trav&eacute;s de la comunidad de c&oacute;digo abierto. Adafruit Industries, un proveedor de componentes 
    electr&oacute;nicos y fabricante de placas de circuito impreso, entre ellas placas Arduino, 
    ubicado en la ciudad de Nueva York, estim&oacute; a mediados del a&ntilde;o 2011 que se hab&iacute;an producido 
    comercialmente m&aacute;s de 300 000 placas Arduino oficiales. En el a&ntilde;o 2013, estim&oacute; que se 
    encontraban en manos de usuarios 700,000 placas Arduino oficiales. 
   </p>

   <p> En octubre del a&ntilde;o 2016, Federico Musto (actualmente ex CEO de Arduino), adquiri&oacute; el 50% de la 
      compa&ntilde;&iacute;a tras haber adquirido las acciones de uno de los miembros fundadores del equipo. 
      En abril del a&ntilde;o 2017, la revista Wired inform&oacute; que Musto hab&iacute;a "fabricado su propio e
      xpediente acad&eacute;mico", habi&eacute;ndolo publicado en el sitio web de Arduino, cuenta personal de 
      LinkedIn, e incluso en documentos comerciales oficiales italianos. 
   </p>
     <p> Musto afirmaba tener un PhD en ciencias de la computaci&oacute;n por el Instituto Tecnol&oacute;gico de 
      Massachusetts (MIT), y un MBA de la Universidad de Nueva York. La revista Wired report&oacute; que ninguna de
       las universidades donde &eacute;l afirmaba haber estudiado ten&iacute;a registro alguno de la asistencia de 
       Musto. 
      </p>
       Musto afirm&oacute; m&aacute;s tarde, en una entrevista a Wired, que realmente nunca hab&iacute;a obtenido los grados acad&eacute;micos. En el a&ntilde;o 2017, Massimo Banzi anunci&oacute; la creaci&oacute;n de la Fundaci&iacute;n Arduino, declarando que ser&iacute;a un nuevo comienzo para Arduino. Dicha fundaci&oacute;n, seg&uacute;n palabras del mismo Banzi, permitir&aacute; defender los valores fundamentales de la Comunidad Arduino dentro del ecosistema de c&oacute;digo abierto y hacer que nuestro compromiso ( haciendo referencia a la empresa Arduini) con el c&oacute;digo abierto sea m&aacute;s s&oacute;lido que nunca. Sin embargo ha existido cierta incertidumbre del desarrollo actual de dicha iniciativa.La controversia en torno a Federico Musto continu&oacute; en julio del a&ntilde;o 2017, seg&uacute;n los informes, por haber retirado licencias de c&oacute;digo abierto, esquemas y c&oacute;digos del sitio web de Arduino, lo que provoc&oacute; escrutinio y protesta por parte de la comunidad de makers.En octubre del a&ntilde;o 2017, Arduino anunci&oacute; su asociaci&oacute;n con la multinacional ARM Holdings (ARM). El anuncio dec&iacute;a, en parte, que "ARM reconoce la independencia como un valor central de Arduino... sin ning&uacute;n acuerdo de uso exclusivo con la arquitectura ARM". Arduino tiene la intenci&oacute;n de seguir trabajando con todos los proveedores y arquitecturas de tecnolog&iacute;a.Para la producci&oacute;n en serie de la primera versi&oacute;n se tom&oacute; en cuenta que el coste no fuera mayor de 30 euros, que fuera ensamblado en una placa de color azul, deb&iacute;a ser Plug and Play y que trabajara con todas las plataformas inform&aacute;ticas tales como MacOSX, Windows y GNU/Linux. Las primeras 300 unidades de Arduino se las dieron a los alumnos del Instituto IVREA, con el fin de que las probaran y empezaran a dise&ntilde;ar sus primeros prototipos.</p>

  
    <h2> <u> CREADORES </u>  </h2>

   
   <P>El Arduino Uno es una placa de microcontrolador de c&oacute;digo abierto basado en el microchip ATmega328P y desarrollado por Arduino.cc. La placa est&aacute; equipada con conjuntos de pines de E/S digitales y anal&oacute;gicas que pueden conectarse a varias placas de expansi&oacute;n y otros circuitos. La placa tiene 14 pines digitales, 6 pines anal&oacute;gicos y programables con el Arduino IDE (Entorno de desarrollo integrado) a trav&eacute;s de un cable USB tipo B. Puede ser alimentado por el cable USB o por una bater&iacute;a externa de 9 voltios, aunque acepta voltajes entre 7 y 20 voltios. Tambi&eacute;n es similar al Arduino Nano y Leonardo. El dise&ntilde;o de referencia de hardware se distribuye bajo una licencia Creative Commons Attribution Share-Alike 2.5 y est&aacute; disponible en el sitio web de Arduino. Los archivos de dise&ntilde;o y producci&oacute;n para algunas versiones del hardware tambi&eacute;n est&aacute;n disponibles. La palabra "uno" significa en italiano lo mismo que en espa&ntilde;ol, y se eligi&oacute; para marcar el lanzamiento inicial del software Arduino. La placa Uno es la primera de una serie de placas Arduino basadas en USB, y la versi&oacute;n 1.0 del Arduino IDE fueron las versiones de referencia de Arduino, ahora evolucionadas a nuevas versiones. El ATmega328 en la placa viene preprogramado con un cargador de arranque que le permite cargar un nuevo c&oacute;digo sin el uso de un programador de hardware externo. </center> 
   
   <br>

   <h3> Para m&aacute;s informaci&oacute;n entrar a los siguientes enlaces: </h3>

   <p><a href="pinout.html"> Funciones Espaciales </a></p>
   <p><a href="tecnicas.html"> Caracter&iacute;sticas T&eacute;cnicas</a></p>
   <p><a href="transfondo.html"> Transfondo Del Arduino Uno</a></p>
</center>
</body>
   </html>
